# Pandas-DataFrame And Series

Pandas is a powerful data manipulation library in Python, widely used for data analysis and data cleaning. It provides two primary data structures: Series and DataFrame. A Series is a one-dimensional array-like object, while a DataFrame is a two-dimensional, size-mutable, and potentially heterogeneous tabular data structure with labeled axes (rows and columns).

In [63]:
pip install pandas

Requirement already satisfied: pandas in /Users/vmangla/Documents/Vaibhav/Programming/Python/Python_ML_DL/.venv/lib/python3.11/site-packages (2.3.3)
Requirement already satisfied: numpy>=1.23.2 in /Users/vmangla/Documents/Vaibhav/Programming/Python/Python_ML_DL/.venv/lib/python3.11/site-packages (from pandas) (2.3.5)
Requirement already satisfied: python-dateutil>=2.8.2 in /Users/vmangla/Documents/Vaibhav/Programming/Python/Python_ML_DL/.venv/lib/python3.11/site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in /Users/vmangla/Documents/Vaibhav/Programming/Python/Python_ML_DL/.venv/lib/python3.11/site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in /Users/vmangla/Documents/Vaibhav/Programming/Python/Python_ML_DL/.venv/lib/python3.11/site-packages (from pandas) (2025.3)
Requirement already satisfied: six>=1.5 in /Users/vmangla/Documents/Vaibhav/Programming/Python/Python_ML_DL/.venv/lib/python3.11/site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Note: you may need to restart the kernel to use updated packages.

In [64]:
import pandas as pd

In [65]:
# Series
# A Pandas Series is a one-dimensional array-like object that can hold any data type. It is similar to a column in a table.

data = [1,2,3,4,5]
series = pd.Series(data)
print("Series \n", series)
print(type(series))

Series
 0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.core.series.Series'>

In [66]:
# Create a series with dictionary
data_dict = {'a': 10, 'b': 20, 'c': 30}
series_dict = pd.Series(data_dict)
print("\nSeries from Dictionary \n", series_dict)
print(type(series_dict))

Series from Dictionary
 a    10
b    20
c    30
dtype: int64
<class 'pandas.core.series.Series'>

In [67]:
data = [1,2,3,4,5]
index = ['a', 'b', 'c', 'd', 'e']
series_with_index = pd.Series(data, index=index)
print("\nSeries with Custom Index \n", series_with_index)

Series with Custom Index
 a    1
b    2
c    3
d    4
e    5
dtype: int64

In [68]:
# Dataframe
# Create a Dataframe from a dictionary of list

data={
    'Name':['Vaibhav','Prashiv','Saksham'],
    'Age':[21,22,19],
    'City':['Chandigarh','Delhi','Chennai']
}
df = pd.DataFrame(data)
print(df)
print(type(df))

      Name  Age        City
0  Vaibhav   21  Chandigarh
1  Prashiv   22       Delhi
2  Saksham   19     Chennai
<class 'pandas.core.frame.DataFrame'>

In [96]:
# Create a dataframe from a list of dictionaries
data = [
    {'Name': 'Alice', 'Age': 25, 'City': 'New York'},
    {'Name': 'Bob', 'Age': 30, 'City': 'San Francisco'},
    {'Name': 'Charlie', 'Age': 35, 'City': 'Los Angeles'}
]
df = pd.DataFrame(data)
print("\nDataframe from List of Dictionaries \n", df)
print(type(df))

Dataframe from List of Dictionaries
       Name  Age           City
0    Alice   25       New York
1      Bob   30  San Francisco
2  Charlie   35    Los Angeles
<class 'pandas.core.frame.DataFrame'>

In [70]:
df = pd.read_csv('sales_data.csv')  
df.head(5)

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal

In [71]:
df.tail(5)

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
235,10236,2024-08-23,Home Appliances,Nespresso Vertuo Next Coffee and Espresso Maker,1,159.99,159.99,Europe,PayPal
236,10237,2024-08-24,Clothing,Nike Air Force 1 Sneakers,3,90.00,270.00,Asia,Debit Card
237,10238,2024-08-25,Books,The Handmaid's Tale by Margaret Atwood,3,10.99,32.97,North America,Credit Card
238,10239,2024-08-26,Beauty Products,Sunday Riley Luna Sleeping Night Oil,1,55.00,55.00,Europe,PayPal
239,10240,2024-08-27,Sports,Yeti Rambler 20 oz Tumbler,2,29.99,59.98,Asia,Credit Card

In [97]:
df['Name']

0      Alice
1        Bob
2    Charlie
Name: Name, dtype: object

In [98]:
df.loc[0]  # First row

Name       Alice
Age           25
City    New York
Name: 0, dtype: object

In [99]:
df.iloc[0][2]

/var/folders/y1/44jbvlv94_5c1bldzjp1gnlh0000gn/T/ipykernel_3051/2519637664.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.iloc[0][2]

'New York'

In [100]:
# Accessing a specified element
df.at[1, 'Age']

np.int64(30)

In [101]:
df.at[1, 'Name']

'Bob'

In [102]:
df.iat[2,2]

'Los Angeles'

In [103]:
# Data Manipulation with dataframes
df
df['Salary'] = [90000, 85000, 78000]
df

      Name  Age           City  Salary
0    Alice   25       New York   90000
1      Bob   30  San Francisco   85000
2  Charlie   35    Los Angeles   78000

In [104]:
# Remove the column
df.drop('Salary', axis=1, inplace=True)
df

      Name  Age           City
0    Alice   25       New York
1      Bob   30  San Francisco
2  Charlie   35    Los Angeles

In [105]:
# Add Age to the existing Age column
df['Age'] = df['Age'] + 1
df

      Name  Age           City
0    Alice   26       New York
1      Bob   31  San Francisco
2  Charlie   36    Los Angeles

In [106]:
df.drop(0, inplace=True)
df

      Name  Age           City
1      Bob   31  San Francisco
2  Charlie   36    Los Angeles

In [107]:
df=pd.read_csv('sales_data.csv')
df.head(5)

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal

In [108]:
# Display the data types of each column
print("Data types:\n", df.dtypes)

# Describe the DataFrame
print("Statistical summary:\n", df.describe())

Data types:
 Transaction ID        int64
Date                 object
Product Category     object
Product Name         object
Units Sold            int64
Unit Price          float64
Total Revenue       float64
Region               object
Payment Method       object
dtype: object
Statistical summary:
        Transaction ID  Units Sold   Unit Price  Total Revenue
count       240.00000  240.000000   240.000000     240.000000
mean      10120.50000    2.158333   236.395583     335.699375
std          69.42622    1.322454   429.446695     485.804469
min       10001.00000    1.000000     6.500000       6.500000
25%       10060.75000    1.000000    29.500000      62.965000
50%       10120.50000    2.000000    89.990000     179.970000
75%       10180.25000    3.000000   249.990000     399.225000
max       10240.00000   10.000000  3899.990000    3899.990000

In [109]:
df.describe()

       Transaction ID  Units Sold   Unit Price  Total Revenue
count       240.00000  240.000000   240.000000     240.000000
mean      10120.50000    2.158333   236.395583     335.699375
std          69.42622    1.322454   429.446695     485.804469
min       10001.00000    1.000000     6.500000       6.500000
25%       10060.75000    1.000000    29.500000      62.965000
50%       10120.50000    2.000000    89.990000     179.970000
75%       10180.25000    3.000000   249.990000     399.225000
max       10240.00000   10.000000  3899.990000    3899.990000